from utils import important_message

def main () -> None:
    """
    Функция, которая запрашивает у пользователя сообщение и выводит его с помощью функции important_message из другого модуля.
    """
    text = input()
    print(important_message(text))
    
# >>> main()
# ЗАГОЛОВОК ПРОГРАММЫ
#==================================================================#
#                                                                  #
#                       ЗАГОЛОВОК ПРОГРАММЫ                        #
#                                                                  #
#==================================================================#    